---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBarType.StandardHookBendDiameter
source: html/87851d76-411f-c305-57a0-aaf75a7d0007.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.StandardHookBendDiameter Property

Defines hook bend diameter for rebar whose style is standard

## Syntax (C#)
```csharp
public double StandardHookBendDiameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: the bend diameter standardHookBendDiam isn't between bar diameter and 99.0